{
	"accept": "List of types the server accepts, typically a file type.",
	"accept-charset": "List of supported charsets.",
	"accesskey": "Defines a keyboard shortcut to activate or add focus to the element.",
	"action": "The URI of a program that processes the information submitted via the form.",
	"align": "Specifies the horizontal alignment of the element.",
	"allow": "Specifies a feature-policy for the iframe.",
	"alt": "Alternative text in case an image can't be displayed.",
	"async": "Indicates that the script should be executed asynchronously.",
	"autocapitalize": "Controls whether and how text input is automatically capitalized as it is entered/edited by the user.",
	"autocomplete": "Indicates whether controls in this form can by default have their values automatically completed by the browser.",
	"autofocus": "The element should be automatically focused after the page loaded.",
	"autoplay": "The audio or video should play as soon as possible.",
	"bgcolor": " Background color of the element. Note: This is a legacy attribute. Please use the CSS background-color property instead.",
	"border": "The border width. Note: This is a legacy attribute. Please use the CSS border property instead.",
	"buffered": "Contains the time range of already buffered media.",
	"challenge": "A challenge string that is submitted along with the public key.",
	"charset": "Declares the character encoding of the page or script.",
	"checked": "Indicates whether the element should be checked on page load.",
	"cite": "Contains a URI which points to the source of the quote or change.",
	"class": "Often used with CSS to style elements with common properties.",
	"code": "Specifies the URL of the applet's class file to be loaded and executed.",
	"codebase": "This attribute gives the absolute or relative URL of the directory where applets' .class files referenced by the code attribute are stored.",
	"color": " This attribute sets the text color using either a named color or a color specified in the hexadecimal #RRGGBB format. Note: This is a legacy attribute. Please use the CSS color property instead.",
	"cols": "Defines the number of columns in a textarea.",
	"colspan": "The colspan attribute defines the number of columns a cell should span.",
	"content": "A value associated with http-equiv or name depending on the context.",
	"contenteditable": "Indicates whether the element's content is editable.",
	"contextmenu": "Defines the ID of a <menu> element which will serve as the element's context menu.",
	"controls": "Indicates whether the browser should show playback controls to the user.",
	"coords": "A set of values specifying the coordinates of the hot-spot region.",
	"crossorigin": "How the element handles cross-origin requests",
	"csp": "Specifies the Content Security Policy that an embedded document must agree to enforce upon itself.",
	"data": "Specifies the URL of the resource.",
	"data-*": "Lets you attach custom attributes to an HTML element.",
	"datetime": "Indicates the date and time associated with the element.",
	"decoding": "Indicates the preferred method to decode the image.",
	"default": "Indicates that the track should be enabled unless the user's preferences indicate something different.",
	"defer": "Indicates that the script should be executed after the page has been parsed.",
	"dir": "Defines the text direction. Allowed values are ltr (Left-To-Right) or rtl (Right-To-Left)",
	"dirname": " ",
	"disabled": "Indicates whether the user can interact with the element.",
	"download": "Indicates that the hyperlink is to be used for downloading a resource.",
	"draggable": "Defines whether the element can be dragged.",
	"dropzone": "Indicates that the element accept the dropping of content on it.",
	"enctype": "Defines the content type of the form date when the method is POST.",
	"for": "Describes elements which belongs to this one.",
	"form": "Indicates the form that is the owner of the element.",
	"formaction": "Indicates the action of the element, overriding the action defined in the <form>.",
	"headers": "IDs of the <th> elements which applies to this element.",
	"height": " Specifies the height of elements listed here. For all other elements, use the CSS height property. Note: In some instances, such as <div>, this is a legacy attribute, in which case the CSS height property should be used instead.",
	"hidden": "Prevents rendering of given element, while keeping child elements, e.g. script elements, active.",
	"high": "Indicates the lower bound of the upper range.",
	"href": "The URL of a linked resource.",
	"hreflang": "Specifies the language of the linked resource.",
	"http-equiv": "Defines a pragma directive.",
	"icon": "Specifies a picture which represents the command.",
	"id": "Often used with CSS to style a specific element. The value of this attribute must be unique.",
	"importance": "Indicates the relative fetch priority for the resource.",
	"integrity": "Security Feature that allows browsers to verify what they fetch.",
	"is": "Allows you to specify that a standard HTML element should behave like a registered custom built-in element (see Using custom elements for more details).",
	"ismap": "Indicates that the image is part of a server-side image map.",
	"itemprop": " ",
	"keytype": "Specifies the type of key generated.",
	"kind": "Specifies the kind of text track.",
	"label": "Specifies a user-readable title of the text track.",
	"lang": "Defines the language used in the element.",
	"language": "Defines the script language used in the element.",
	"lazyload": "Indicates if the element should be loaded lazily.",
	"list": "Identifies a list of pre-defined options to suggest to the user.",
	"loop": "Indicates whether the media should start playing from the start when it's finished.",
	"low": "Indicates the upper bound of the lower range.",
	"manifest": "Specifies the URL of the document's cache manifest.",
	"max": "Indicates the maximum value allowed.",
	"maxlength": "Defines the maximum number of characters allowed in the element.",
	"minlength": "Defines the minimum number of characters allowed in the element.",
	"media": "Specifies a hint of the media for which the linked resource was designed.",
	"method": "Defines which HTTP method to use when submitting the form. Can be GET (default) or POST.",
	"min": "Indicates the minimum value allowed.",
	"multiple": "Indicates whether multiple values can be entered in an input of the type email or file.",
	"muted": "Indicates whether the audio will be initially silenced on page load.",
	"name": "Name of the element. For example used by the server to identify the fields in form submits.",
	"novalidate": "This attribute indicates that the form shouldn't be validated when submitted.",
	"open": "Indicates whether the details will be shown on page load.",
	"optimum": "Indicates the optimal numeric value.",
	"pattern": "Defines a regular expression which the element's value will be validated against.",
	"ping": " ",
	"isExpression": "Provides a hint to the user of what can be entered in the field.",
	"poster": "A URL indicating a poster frame to show until the user plays or seeks.",
	"preload": "Indicates whether the whole resource, parts of it or nothing should be preloaded.",
	"radiogroup": " ",
	"readonly": "Indicates whether the element can be edited.",
	"rel": "Specifies the relationship of the target object to the link object.",
	"required": "Indicates whether this element is required to fill out or not.",
	"reversed": "Indicates whether the list should be displayed in a descending order instead of a ascending.",
	"rows": "Defines the number of rows in a text area.",
	"rowspan": "Defines the number of rows a table cell should span over.",
	"sandbox": "Stops a document loaded in an iframe from using certain features (such as submitting forms or opening new windows).",
	"scope": "Defines the cells that the header test (defined in the th element) relates to.",
	"scoped": " ",
	"selected": "Defines a value which will be selected on page load.",
	"shape": " ",
	"size": "Defines the width of the element (in pixels). If the element's type attribute is text or password then it's the number of characters.",
	"sizes": " ",
	"slot": "Assigns a slot in a shadow DOM shadow tree to an element.",
	"span": " ",
	"spellcheck": "Indicates whether spell checking is allowed for the element.",
	"src": "The URL of the embeddable content.",
	"srcdoc": " ",
	"srclang": " ",
	"srcset": "One or more responsive image candidates.",
	"start": "Defines the first number if other than 1.",
	"step": " ",
	"style": "Defines CSS styles which will override styles previously set.",
	"summary": " ",
	"tabindex": "Overrides the browser's default tab order and follows the one specified instead.",
	"target": " ",
	"title": "Text to be displayed in a tooltip when hovering over the element.",
	"translate": "Specify whether an element’s attribute values and the values of its Text node children are to be translated when the page is localized, or whether to leave them unchanged.",
	"type": "Defines the type of the element.",
	"usemap": " ",
	"value": "Defines a default value which will be displayed in the element on page load.",
	"width": "For the elements listed here, this establishes the element's width. Note: For all other instances, such as <div>, this is a legacy attribute, in which case the CSS width property should be used instead.",
	"wrap": "Indicates whether the text should be wrapped."
}